app/controllers/opro/oauth/token_controller.rb

SELECT `opro_auth_grants`.* FROM `opro_auth_grants` WHERE `opro_auth_grants`.`devise_token` = 'hegfdjwhdwjhdwhwefafsffd'
DELETE FROM `opro_auth_grants` WHERE `opro_auth_grants`.`id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'kinjal@itoneclick.com'  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `opro_client_apps`.* FROM `opro_client_apps` WHERE `opro_client_apps`.`user_id` = 1  ORDER BY `opro_client_apps`.`id` ASC LIMIT 1
---
  def create
    # Find the client application
    if !params[:device_token].blank?
      @token = Opro::Oauth::AuthGrant.where(devise_token: params[:device_token])
      if !@token.blank?
        @token.destroy_all
      end
      @user=User.where(email: params[:email]).first
      if !@user.blank?
        application = Opro::Oauth::ClientApp.where(user_id: @user.id).first