app/controllers/api/v1/devices_controller.rb

  def create
    @device = Device.create(device_params)
---
INSERT INTO `devices` (`user_id`, `ble_address`, `name`, `is_active`, `created_at`, `updated_at`) VALUES (1, 'asjdgajdbhj', 'abcs', 1, '2017-07-06 11:13:31', '2017-07-06 11:13:31')

  def index
    @device = Device.all
---
SELECT `devices`.* FROM `devices`

  def update
    @device = Device.find(params[:id])
    if @device.update(device_params)
---
SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 1 LIMIT 1
UPDATE `devices` SET `name` = 'abcssdasd', `updated_at` = '2017-07-06 13:11:22' WHERE `devices`.`id` = 1

  def destroy
    begin
    @device = Device.find(params[:id])
    if !@device.blank?
      @device.delete
---
SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 2 LIMIT 1
DELETE FROM `devices` WHERE `devices`.`id` = 2