app/controllers/api/v1/plays_controller.rb

  def create
    @play = Play.create(play_params)
---
INSERT INTO `plays` (`user_id`, `name`, `description`, `led_no`, `created_at`, `updated_at`) VALUES (1, 'abcs', 'asjdgajdbhj', 'jbwjdbjasdjd', '2017-07-06 14:41:21', '2017-07-06 14:41:21')

  def index
    @play = Play.where(user_id: params[:user_id])
    if !@play.blank?
---
SELECT `plays`.* FROM `plays`

  def update
    @play = Play.find(params[:id])
    if @play.update(play_params)
---
SELECT  `plays`.* FROM `plays` WHERE `plays`.`id` = 3 LIMIT 1
UPDATE `plays` SET `description` = 'asjdgajdbhjsdfcds', `updated_at` = '2017-07-06 14:46:33' WHERE `plays`.`id` = 3

  def destroy
    begin
    @play = Play.find(params[:id])
    if !@play.blank?
      @play.delete
---
SELECT  `plays`.* FROM `plays` WHERE `plays`.`id` = 3 LIMIT 1
DELETE FROM `plays` WHERE `plays`.`id` = 3