app/controllers/api/v1/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'kinjal@itoneclick.com'
SELECT  1 AS one FROM `users` WHERE `users`.`email` = BINARY 'kinjal@itoneclick.com' LIMIT 1
INSERT INTO `users` (`first_name`, `last_name`, `encrypted_password`, `email`, `device_token`, `device_type`, `created_at`, `updated_at`) VALUES ('kinjal', 'babariya', '$2a$11$fVhp9G7EiPfwX0Bk0t7iVuDNRC0qDYTKbWk8QSZoZa6FKVDs869Da', 'kinjal@itoneclick.com', 'adadfwwdsdqwdwdddaadgrtuhtyjuysdwde', '1', '2017-07-03 12:13:10', '2017-07-03 12:13:10')
INSERT INTO `opro_client_apps` (`user_id`, `name`, `app_id`, `app_secret`, `created_at`, `updated_at`) VALUES (1, 'kinjal1', '05c0e5cece183663d969b5b4af2bc4d4', 'fd32b204e7f7261bcbe13dcd1899014e', '2017-07-03 09:50:53', '2017-07-03 09:50:53')
SELECT `opro_client_apps`.* FROM `opro_client_apps` WHERE `opro_client_apps`.`app_id` = '05c0e5cece183663d969b5b4af2bc4d4'
---
  def create
    puts user_params[:email]
    @u = User.where(email: user_params[:email]).first
    if @u.blank?
      @user = User.create(user_params)
      if @user.save
        Opro::Oauth::ClientApp.create_with_user_and_name(@user, @user.first_name+ @user.id.to_s)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `encrypted_password` = '$2a$11$YL6tAe9Z1H0Tr.H342vkfu7gBbvCG65EUsWBPmb3v.jiFVJhuURca', `email` = 'kinjal12@itoneclick.com', `updated_at` = '2017-07-07 08:22:28' WHERE `users`.`id` = 1
---
  def update
    # if User.where(:email => params[:user][:email]).exists?
    #   render :json => { action: 'register',
    #                       response: 'false',
    #                       msg: "email has already been taken"
    #                       }
    # else
      @user = User.find(params[:id])
      if @user.update(user_params)

SELECT  `opro_auth_grants`.* FROM `opro_auth_grants` WHERE `opro_auth_grants`.`access_token` = 'e09361bda77fb09ef566ce0680511a84'  ORDER BY `opro_auth_grants`.`id` ASC LIMIT 1
DELETE FROM `opro_auth_grants` WHERE `opro_auth_grants`.`id` = 19
---
  def logout
    @token = Opro::Oauth::AuthGrant.where(access_token: params[:access_token])
    if !@token.blank?
      @token.destroy_all